microservices/tests/jmeter/onlineboutique_webdriver_plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="OnlineBoutique WebDriver Performance Test" enabled="true">
      <stringProp name="TestPlan.comments">4.2.2 初始方案：JMeter + WebDriver 模拟浏览器测试</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_URL" elementType="Argument">
            <stringProp name="Argument.name">BASE_URL</stringProp>
            <stringProp name="Argument.value">127.0.0.1</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PORT" elementType="Argument">
            <stringProp name="Argument.name">PORT</stringProp>
            <stringProp name="Argument.value">55255</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="WebDriver Test - 5 Users Low Concurrency" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">3</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">5</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <com.googlecode.jmeter.plugins.webdriver.config.ChromeDriverConfig guiclass="com.googlecode.jmeter.plugins.webdriver.config.gui.ChromeDriverConfigGui" testclass="com.googlecode.jmeter.plugins.webdriver.config.ChromeDriverConfig" testname="jp@gc - Chrome Driver Config" enabled="true">
          <stringProp name="ChromeDriverConfig.chromedriver_path">C:/Program Files/Google/Chrome/Application/chromedriver-win64/chromedriver.exe</stringProp>
          <boolProp name="ChromeDriverConfig.android_enabled">false</boolProp>
          <boolProp name="ChromeDriverConfig.headless">true</boolProp>
          <boolProp name="ChromeDriverConfig.incognito_enabled">false</boolProp>
          <boolProp name="ChromeDriverConfig.no_sandbox_enabled">true</boolProp>
          <stringProp name="ChromeDriverConfig.arguments">--disable-gpu --disable-dev-shm-usage --disable-extensions</stringProp>
          <boolProp name="ChromeDriverConfig.maximize_browser">false</boolProp>
        </com.googlecode.jmeter.plugins.webdriver.config.ChromeDriverConfig>
        <hashTree/>
        <com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler guiclass="com.googlecode.jmeter.plugins.webdriver.sampler.gui.WebDriverSamplerGui" testclass="com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler" testname="WebDriver Sampler: Navigate to Root /" enabled="true">
          <stringProp name="WebDriverSampler.scriptLanguage">groovy</stringProp>
          <stringProp name="Script">// WebDriver Sampler: Navigate to Root
WDS.sampleResult.sampleStart();
WDS.browser.get('http://${BASE_URL}:${PORT}/');
WDS.sampleResult.sampleEnd();

// Simple check: mark as failed if page source is empty
if (WDS.browser.getPageSource().length() == 0) {
    WDS.sampleResult.setSuccessful(false);
    WDS.sampleResult.setResponseMessage('Root page did not load');
} else {
    WDS.sampleResult.setSuccessful(true);
    WDS.sampleResult.setResponseMessage('Root page loaded successfully');
}

// Log response info
log.info("Root page - Response time: " + WDS.sampleResult.getTime() + "ms");</stringProp>
        </com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler>
        <hashTree/>
        <com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler guiclass="com.googlecode.jmeter.plugins.webdriver.sampler.gui.WebDriverSamplerGui" testclass="com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler" testname="WebDriver Sampler: Navigate to Cart /cart" enabled="true">
          <stringProp name="WebDriverSampler.scriptLanguage">groovy</stringProp>
          <stringProp name="Script">// WebDriver Sampler: Navigate to Cart
WDS.sampleResult.sampleStart();
WDS.browser.get('http://${BASE_URL}:${PORT}/cart');
WDS.sampleResult.sampleEnd();

// Simple check: mark as failed if page source is empty
if (WDS.browser.getPageSource().length() == 0) {
    WDS.sampleResult.setSuccessful(false);
    WDS.sampleResult.setResponseMessage('Cart page did not load');
} else {
    WDS.sampleResult.setSuccessful(true);
    WDS.sampleResult.setResponseMessage('Cart page loaded successfully');
}

log.info("Cart page - Response time: " + WDS.sampleResult.getTime() + "ms");</stringProp>
        </com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler>
        <hashTree/>
        <com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler guiclass="com.googlecode.jmeter.plugins.webdriver.sampler.gui.WebDriverSamplerGui" testclass="com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler" testname="WebDriver Sampler: Navigate to Checkout /cart/checkout" enabled="true">
          <stringProp name="WebDriverSampler.scriptLanguage">groovy</stringProp>
          <stringProp name="Script">// WebDriver Sampler: Navigate to Checkout
WDS.sampleResult.sampleStart();
WDS.browser.get('http://${BASE_URL}:${PORT}/cart/checkout');
WDS.sampleResult.sampleEnd();

// Simple check: mark as failed if page source is empty
if (WDS.browser.getPageSource().length() == 0) {
    WDS.sampleResult.setSuccessful(false);
    WDS.sampleResult.setResponseMessage('Checkout page did not load');
} else {
    WDS.sampleResult.setSuccessful(true);
    WDS.sampleResult.setResponseMessage('Checkout page loaded successfully');
}

log.info("Checkout page - Response time: " + WDS.sampleResult.getTime() + "ms");</stringProp>
        </com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler>
        <hashTree/>
        <com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler guiclass="com.googlecode.jmeter.plugins.webdriver.sampler.gui.WebDriverSamplerGui" testclass="com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler" testname="WebDriver Sampler: Navigate to Product /product/OLJCESPC7Z" enabled="true">
          <stringProp name="WebDriverSampler.scriptLanguage">groovy</stringProp>
          <stringProp name="Script">// WebDriver Sampler: Navigate to Product
WDS.sampleResult.sampleStart();
WDS.browser.get('http://${BASE_URL}:${PORT}/product/OLJCESPC7Z');
WDS.sampleResult.sampleEnd();

// Simple check: mark as failed if page source is empty
if (WDS.browser.getPageSource().length() == 0) {
    WDS.sampleResult.setSuccessful(false);
    WDS.sampleResult.setResponseMessage('Product page did not load');
} else {
    WDS.sampleResult.setSuccessful(true);
    WDS.sampleResult.setResponseMessage('Product page loaded successfully');
}

log.info("Product page - Response time: " + WDS.sampleResult.getTime() + "ms");</stringProp>
        </com.googlecode.jmeter.plugins.webdriver.sampler.WebDriverSampler>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">results/webdriver_results.jtl</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>